SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
/**
 * *****************************************************************************
 * @file    main.c
 * @brief   Standalone Camera + ToF Snapshot Capture — NUCLEO-N657X0-Q
 *
 *   Captures images from the CMW-IMX335 camera module and stores them as
 *   raw YUV422 frames on a microSD card.  Includes VL53L5CX Time-of-Flight
 *   sensor integration for distance measurements.
 *
 *   No USB/UVC, no FileX/fatfs, no PC connection required after flashing.
 *
 *   Hardware:
 *     - MCU:      STM32N657 (NUCLEO-N657X0-Q / MB1940)
 *     - Camera:   CMW-IMX335 (5 MP, YUV422 output via CSI-2)
 *     - ToF:      VL53L5CX (8x8 resolution, continuous mode)
 *     - Storage:  microSD card (SDMMC2, 4-bit bus)
 *     - Button:   USER B1 = PC13 (active HIGH, external pull-down)
 *     - LEDs:     RED = PG10, GREEN = PG0
 *     - Illumination: WS2812 (GPDMA1 + TIM1 PWM)
 *
 *   Flow (OPTIMIZED - Sleep Mode):
 *     1. Boot → init clocks, MPU, PSRAM, SD card
 *     2. Init camera + warmup frames (one-time cost at boot)
 *     3. STOP camera pipe (sleep = low power, fast wakeup)
 *     4. GREEN LED on (system ready)
 *     5. User presses USER button (PC13)
 *     6. START pipe → 3 frames → capture → STOP pipe (~100ms total)
 *     7. Frame saved to SD card
 *     8. Back to sleep → wait for next press
 *
 *   Two FreeRTOS tasks:
 *     - main_thread: board init, SD card init, camera sleep mode init,
 *                    then deletes itself
 *     - btn_thread:  polls USER button, triggers fast capture + SD write
 *
 *   All configurable parameters are in Inc/app_config.h.
 * *****************************************************************************
 */

/* ================================================================
   SECTION 1: INCLUDES
   ================================================================ */

#include <assert.h>
#include <stdio.h>
#include <string.h>

/* ---- STM32 HAL / BSP ---- */
#include "stm32n6xx_hal_conf.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_hal_sd.h"
#include "stm32n6xx_hal_rif.h"
//#include "stm32n6xx_nucleo.h"
//#include "stm32n6xx_nucleo_bus.h"
//#include "stm32n6xx_nucleo_xspi.h"

#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_xspi.h"

/* ---- Illumination (WS2812) ---- */
#include "ws2812.h"

/* ---- Time of Flight (VL53L5CX) ---- */
#include "platform.h"
#include "vl53l5cx_api.h"
#include "vl53l5cx_plugin_motion_indicator.h"

/* ---- Application Modules ---- */
#include "app_config.h"
#include "app_cam.h"
#include "app_fuseprogramming.h"
#include "main.h"
#include "npu_cache.h"
#include "utils.h"

/* ---- FreeRTOS ---- */
#include "FreeRTOS.h"
#include "task.h"

#define BASELINE5CX_SAMPLES      10      /* Frames to learn baseline per zone */
#define INSECT5CX_THRESHOLD_PCT  6      /* Signal drop % to trigger detection */
#define NUM_ZONES                16      /* 4x4 resolution = 16 zones */
#define MOTION_INDICATOR_THRESH  20

/* Adaptive baseline filter:
   When enabled, slowly updates the signal/distance baseline using EMA
   for zones NOT currently affected by detection. This compensates for
   natural drift (temperature, ambient light) without chasing real objects.
   Set to 1 to enable, 0 to disable (fixed baseline from startup). */
#define ADAPTIVE_BASELINE_ENABLED  0

/* EMA smoothing factor (only used when ADAPTIVE_BASELINE_ENABLED = 1)
   Larger = slower adaptation, Smaller = faster adaptation
   At 15Hz frame rate: 256 ≈ 17s time constant, 1024 ≈ 68s time constant */
#define BASELINE_EMA_DIVIDER       256

/* Debug output for Python visualization:
   When enabled, prints a FRAME line every N frames with per-zone data.
   Format: FRAME,sig1,base1,dist1,bdist1,...,sig16,base16,dist16,bdist16
   Set to 0 to disable, or to a frame interval (e.g., 5 = every 5th frame). */
#define DEBUG_FRAME_INTERVAL       2

#define VL53L5CX_ZONES_ALL         0xFFFF   /* All 16 zones */
#define VL53L5CX_ZONES_CENTER_4    0x0660   /* Center 2x2: Z5,Z6,Z9,Z10 */
#define VL53L5CX_ZONES_TOP_ROW     0x000F   /* Top row: Z0,Z1,Z2,Z3 */
#define VL53L5CX_ZONES_BOTTOM_ROW  0xF000   /* Bottom row: Z12,Z13,Z14,Z15 */
#define VL53L5CX_ZONES_LEFT_COL    0x1111   /* Left column: Z0,Z4,Z8,Z12 */
#define VL53L5CX_ZONES_RIGHT_COL   0x8888   /* Right column: Z3,Z7,Z11,Z15 */
#define VL53L5CX_ZONES_CENTER_2x2  0x0660   /* Same as CENTER_4 */
#define VL53L5CX_ZONES_CORNERS     0x8009   /* 4 corners: Z0,Z3,Z12,Z15 */

/* ================================================================
   SECTION 2: GLOBAL PERIPHERAL HANDLES
   ================================================================ */

/* I2C */
I2C_HandleTypeDef hi2c1;

/* UART (Debug Console) */
UART_HandleTypeDef huart1;

/* microSD (SDMMC2) */
SD_HandleTypeDef hsd1;

/* TIM1 (WS2812 PWM) */
TIM_HandleTypeDef htim1;

/* DMA (WS2812 Data) */
DMA_HandleTypeDef handle_GPDMA1_Channel1;

/* VL53L5CX ToF Sensor State */
VL53L5CX_Configuration  Dev;
VL53L5CX_ResultsData    Results;
uint8_t                 status;
uint8_t                 isAlive;
uint8_t                 isReady;

static uint32_t  g_baseline_signal[NUM_ZONES] = {0};
static uint16_t  g_baseline_distance[NUM_ZONES] = {0};
static uint8_t   g_zone_valid[NUM_ZONES] = {0};
static uint8_t   g_baseline_ready = 0;

/* Global zone mask state */
static uint16_t g_zone_mask      = VL53L5CX_ZONES_CENTER_4;
static uint8_t  g_zone_filter_on = 0;  /* 0 = all zones, 1 = use mask */

/**
 * @brief  Check if a zone is enabled based on current mask
 * @param  z  Zone index (0-15 for 4x4)
 * @return 1 if enabled, 0 if disabled
 */
static inline int is_zone_enabled(uint8_t z)
{
    if (!g_zone_filter_on) return 1;  /* Filter off = all zones enabled */
    return (g_zone_mask >> z) & 1;
}

/**
 * @brief  Set zone mask and enable filtering
 * @param  mask  16-bit mask, bit N = zone N
 */
void VL53L5CX_SetZoneMask(uint16_t mask)
{
    g_zone_mask = mask;
    g_zone_filter_on = 1;
    printf("[ZONE] Mask set to 0x%04X (filter ON)\n", mask);
}

/**
 * @brief  Enable or disable zone filtering
 * @param  enable  1 = use mask, 0 = all zones
 */
void VL53L5CX_EnableZoneFilter(uint8_t enable)
{
    g_zone_filter_on = enable;
    printf("[ZONE] Filter %s (mask=0x%04X)\n",
           enable ? "ON" : "OFF (all zones)", g_zone_mask);
}

/**
 * @brief  Print zone mask as 4x4 grid
 */
void VL53L5CX_PrintZoneMask(void)
{
    printf("\nZone mask: 0x%04X (filter %s)\n", g_zone_mask,
           g_zone_filter_on ? "ON" : "OFF");
    printf("+-------+-------+-------+-------+\n");
    for (int row = 0; row < 4; row++) {
        printf("|");
        for (int col = 0; col < 4; col++) {
            int z = row * 4 + col;
            if (is_zone_enabled(z))
                printf("  Z%2d  |", z);
            else
                printf("  --   |");
        }
        printf("\n+-------+-------+-------+-------+\n");
    }
}

/* ================================================================
   SECTION 3: FREERTOS TASK CONTROL BLOCKS AND STACKS
   ================================================================ */

