SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    if (!sensor_detected) {
        printf("[ERROR] VL53L5CX sensor not detected after 10 retries!\n");
        printf("  Last status: %d, alive: %d\n", status_local, isAlive);
        printf("  Checking I2C bus...\n");

        /* Scan I2C bus to diagnose */
        uint8_t found = 0;
        for (uint8_t addr = 0; addr < 128; addr++) {
            if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 1, 100) == HAL_OK) {
                printf("    I2C device at 0x%02X\n", addr);
                found++;
            }
        }
        if (found == 0)
            printf("  No I2C devices found! Check wiring/power.\n");
        else
            printf("  I2C devices found but VL53L5CX (0x29) not responding.\n");

        /* Try hard reset as last resort */
        printf("[ToF] Attempting hard reset...\n");
        VL53L5CX_GPIO_Init();
        VL53L5CX_StartSequence();
        vTaskDelay(pdMS_TO_TICKS(500));

        status_local = vl53l5cx_is_alive(&Dev, &isAlive);
        if (!isAlive || status_local) {
            printf("[FATAL] VL53L5CX still not detected after hard reset!\n");
            while (1) vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    printf("[ToF] Sensor detected!\n");

    /* Initialize the sensor (with retry) */
    for (uint8_t init_retry = 0; init_retry < 3; init_retry++) {
        status_local = vl53l5cx_init(&Dev);
        if (!status_local) break;
        printf("[ToF] Init failed (status=%d), retry %d/3...\n",
               status_local, init_retry + 1);
        vTaskDelay(pdMS_TO_TICKS(200));
    }
    if (status_local) {
        printf("[ERROR] VL53L5CX init failed after retries: %d\n", status_local);
        while (1) vTaskDelay(pdMS_TO_TICKS(1000));
    }
    printf("[ToF] Sensor initialized\n");

	    /* ---- High-Performance Configuration ---- */
	    status_local = vl53l5cx_set_resolution(&Dev, VL53L5CX_RESOLUTION_4X4);

	    /* Reset baseline state */
	    memset(g_baseline_signal, 0, sizeof(g_baseline_signal));
	    memset(g_baseline_distance, 0, sizeof(g_baseline_distance));
	    memset(g_zone_valid, 0, sizeof(g_zone_valid));
	    g_baseline_ready = 0;

	    /* Integration time: 800 ms */
	    status_local = vl53l5cx_set_integration_time_ms(&Dev, 800);

	    /* Ranging frequency: 15 Hz */
	    status_local = vl53l5cx_set_ranging_frequency_hz(&Dev, 15);

	    /* Always report the closest object */
	    status_local = vl53l5cx_set_target_order(&Dev, VL53L5CX_TARGET_ORDER_CLOSEST);

	    /* Sharpener at 10% */
	    status_local = vl53l5cx_set_sharpener_percent(&Dev, 20);

	    /* Continuous ranging mode */
	    status_local = vl53l5cx_set_ranging_mode(&Dev, VL53L5CX_RANGING_MODE_CONTINUOUS);

	    /* ---- Start Ranging ---- */
	    vl53l5cx_start_ranging(&Dev);
	    VL53L5CX_WaitMs(&(Dev.platform), 200);
	    printf("[ToF] Ranging started...\n");

	    /* ================================================================ */
	    /*  Phase 1: Learn per-zone baseline (ONLY enabled zones)           */
	    /* ================================================================ */
	    printf("\r\n[BASELINE] Taking %d samples for %d enabled zones...\r\n",
	           BASELINE5CX_SAMPLES, enabled_zone_count);

	    for (i = 0; i < BASELINE5CX_SAMPLES; i++)
	    {
	        /* Wait for data ready */
	        do {
	            vl53l5cx_check_data_ready(&Dev, &is_ready);
	            if (!is_ready) vTaskDelay(pdMS_TO_TICKS(10));
	        } while (!is_ready);

	        /* Get results */
	        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
	            continue;

	        /* Accumulate per-zone signal and distance (ONLY enabled zones) */
	        for (int z = 0; z < NUM_ZONES; z++)
	        {
	            /* ZONE FILTER: Skip disabled zones */
	            if (!is_zone_enabled(z))
	                continue;

	            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

	            if (Results.target_status[idx] == 0 ||
	                Results.target_status[idx] == 5 ||
	                Results.target_status[idx] == 9)
	            {
	                g_baseline_signal[z] += Results.signal_per_spad[idx];
	                g_baseline_distance[z] += Results.distance_mm[idx];
	                g_zone_valid[z] = 1;
	            }
	        }

	        printf("  [%d/%d]\r", i + 1, BASELINE5CX_SAMPLES);
	    }

	    /* Compute per-zone averages (ONLY enabled zones) */
	    printf("\r\n[BASELINE] Zone | Distance(mm) | Signal(kcps/spad)\r\n");
	    printf("----------|----------------|----------------------\r\n");

	    uint8_t valid_zone_count = 0;

	    for (int z = 0; z < NUM_ZONES; z++)
	    {
	        /* ZONE FILTER: Only process enabled zones */
	        if (!is_zone_enabled(z))
	            continue;

	        if (g_zone_valid[z])
	        {
	            g_baseline_signal[z] /= BASELINE5CX_SAMPLES;
	            g_baseline_distance[z] /= BASELINE5CX_SAMPLES;
	            valid_zone_count++;

	            printf("  Z%2d    |    %8d     |    %10d\r\n",
	                   z, g_baseline_distance[z], g_baseline_signal[z]);
	        } else {
	            printf("  Z%2d    |    (skip)   |    (no data)\r\n", z);
	        }
	    }

	    printf("\r\n[BASELINE] Valid zones: %d/%d (enabled: %d)\r\n",
	           valid_zone_count, enabled_zone_count, enabled_zone_count);
	    printf("[BASELINE] Insect threshold: >%d%% drop in any enabled zone\r\n",
	           INSECT5CX_THRESHOLD_PCT);

	    if (valid_zone_count < 1) {
	        printf("[ERROR] No valid zones for baseline!\n");
	        printf("  Please check sensor connection and zone mask.\n");
	        VL53L5CX_PrintZoneMask();
	        while (1) {
	            vTaskDelay(pdMS_TO_TICKS(1000));
	        }
	    }

	    g_baseline_ready = 1;

	    /* ================================================================ */
	    /*  Phase 2: Monitor enabled zones for insect detection             */
	    /* ================================================================ */
	    printf("\r\n[MONITORING] Watching %d enabled zones for insect passage...\r\n",
	           valid_zone_count);
	    printf("  Camera will auto-capture on insect detection.\r\n\r\n");

	    uint32_t capture_count = 0;
	    uint32_t cooldown_frames = 0;
	    const uint32_t COOLDOWN_FRAMES_VALUE = 30;

	    while (1)
	    {
	        /* Wait for data ready */
	        do {
	            vl53l5cx_check_data_ready(&Dev, &is_ready);
	            if (!is_ready) vTaskDelay(pdMS_TO_TICKS(10));
	        } while (!is_ready);

	        /* Get results */
	        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
	            continue;

	        /* ---- Check each ENABLED zone against its baseline ---- */
	        uint8_t  insect_found = 0;
	        uint8_t  affected_zones[NUM_ZONES] = {0};
	        uint32_t affected_drop[NUM_ZONES] = {0};
	        uint8_t  affected_count = 0;

	        for (int z = 0; z < NUM_ZONES; z++)
	        {
	            /* ZONE FILTER: Skip disabled zones */
	            if (!is_zone_enabled(z))
	                continue;

	            if (!g_zone_valid[z])
	                continue;  /* Skip zones with no baseline */

	            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

	            if (Results.target_status[idx] != 0 &&
	                Results.target_status[idx] != 5 &&
	                Results.target_status[idx] != 9)
	                continue;  /* Skip invalid measurements */

	            /* Compute signal drop for this zone */
	            uint32_t signal_drop = 0;
	            if (g_baseline_signal[z] > 0)
	            {
	                int32_t diff = (int32_t)g_baseline_signal[z] -
	                               (int32_t)Results.signal_per_spad[idx];
	                if (diff < 0) diff = -diff;
	                signal_drop = (uint32_t)diff * 100 / g_baseline_signal[z];
	            }

