SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
            if (signal_drop > INSECT5CX_THRESHOLD_PCT)
            {
                affected_zones[affected_count] = z;
                affected_drop[affected_count] = signal_drop;
                affected_count++;
                insect_found = 1;
            }
        }

#if ADAPTIVE_BASELINE_ENABLED
        /* ---- Adaptive Baseline: Update ONLY zones NOT affected by detection ----
           This compensates for natural signal drift (temperature, ambient light)
           without corrupting the baseline when an insect is present.
           Affected zones keep their original baseline so short-time peaks don't
           cause the filter to "chase" the object and miss detections. */
        for (int z = 0; z < NUM_ZONES; z++)
        {
            /* Skip disabled or invalid zones */
            if (!is_zone_enabled(z)) continue;
            if (!g_zone_valid[z]) continue;

            /* Check if this zone was flagged as affected */
            uint8_t is_affected = 0;
            for (uint8_t k = 0; k < affected_count; k++) {
                if (affected_zones[k] == z) {
                    is_affected = 1;
                    break;
                }
            }
            if (is_affected) continue;  /* Don't update baseline for affected zones */

            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

            /* Only update if measurement is valid */
            if (Results.target_status[idx] != 0 &&
                Results.target_status[idx] != 5 &&
                Results.target_status[idx] != 9) continue;

            /* EMA update: baseline += (new - baseline) / divider */
            if (g_baseline_signal[z] > 0)
            {
                int32_t diff = (int32_t)Results.signal_per_spad[idx] -
                               (int32_t)g_baseline_signal[z];
                g_baseline_signal[z] += diff / BASELINE_EMA_DIVIDER;
            }
            if (g_baseline_distance[z] > 0)
            {
                int32_t diff = (int32_t)Results.distance_mm[idx] -
                               (int32_t)g_baseline_distance[z];
                g_baseline_distance[z] += diff / BASELINE_EMA_DIVIDER;
            }
        }
#endif

        /* ---- Check cooldown ---- */
	        if (cooldown_frames > 0) {
	            cooldown_frames--;
	        }

	        /* ---- Report results + Trigger camera on detection ---- */
	        if (insect_found && cooldown_frames == 0)
	        {
	            /* Build zone list string */
	            char zone_list[64] = {0};
	            for (uint8_t k = 0; k < affected_count; k++)
	            {
	                char tmp[16];
	                sprintf(tmp, "Z%u", affected_zones[k]);
	                if (k == 0)
	                    strcpy(zone_list, tmp);
	                else {
	                    strcat(zone_list, ",");
	                    strcat(zone_list, tmp);
	                }
	            }

	            printf(">>> INSECT DETECTED! Zones: [%s] (%u zone(s))\r\n",
	                   zone_list, affected_count);

	            /* Print details for each affected zone */
	            for (uint8_t k = 0; k < affected_count; k++)
	            {
	                uint8_t z = affected_zones[k];
	                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
	                printf("    Z%2d: dist=%4dmm  signal=%6d  baseline=%6d  (drop=%u%%)\r\n",
	                       z,
	                       Results.distance_mm[idx],
	                       Results.signal_per_spad[idx],
	                       g_baseline_signal[z],
	                       affected_drop[k]);
	            }

	            /* Compact detection event line for Python visualization
	               Format: DET,capture_count,z1:drop1,z2:drop2,...
	               Example: DET,1,Z3:15,Z7:12 */
	            char det_line[128] = {0};
	            sprintf(det_line, "DET,%lu", (unsigned long)(capture_count + 1));
	            for (uint8_t k = 0; k < affected_count; k++)
	            {
	                char tmp[16];
	                sprintf(tmp, ",Z%u:%u", affected_zones[k], affected_drop[k]);
	                strcat(det_line, tmp);
	            }
	            printf("%s\r\n", det_line);

	            printf("\r\n");

	            /* ---- TRIGGER CAMERA CAPTURE ---- */
	            printf("    Triggering camera capture...\n");

	            BSP_LED_Off(LED_GREEN);
	            BSP_LED_On(LED_RED);

	            /* Flash WS2812 */
	            WS2812_TurnOn();
	            HAL_Delay(100);
	            WS2812_TurnOff();

	            /* Capture image */
	            uint32_t snap_num = capture_count + 1;
	            int rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
	                                            SNAP_WIDTH, SNAP_HEIGHT,
	                                            SNAP_FPS, SNAP_WARMUP_FRAMES);

	            if (rc == 0) {
	                uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;
	                uint32_t total_blocks = (SD_IMG_HEADER_SIZE + frame_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
	                uint32_t target_block = snap_base_block + (capture_count * total_blocks);

	                uint32_t saved_base = SD_IMG_BASE_BLOCK;
	                SD_IMG_BASE_BLOCK = target_block;

	                if (SD_StoreRawImage(capture_buf, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
	                    capture_count++;
	                    printf("    >>> Snapshot #%lu SAVED!\n", (unsigned long)snap_num);
	                } else {
	                    printf("    [ERROR] SD write failed!\n");
	                }

	                SD_IMG_BASE_BLOCK = saved_base;
	            } else {
	                printf("    [ERROR] Camera capture failed (rc=%d)!\n", rc);
	            }

	            BSP_LED_Off(LED_RED);
	            BSP_LED_On(LED_GREEN);

	            /* Apply cooldown */
	            cooldown_frames = COOLDOWN_FRAMES_VALUE;
	            printf("    Cooldown: %d frames (%.1f seconds)\n\n",
	                   COOLDOWN_FRAMES_VALUE, (float)COOLDOWN_FRAMES_VALUE / 15.0f);

