SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
	        }
	        else
	        {
	            /* Compact status line */
	            uint16_t min_d = 9999, max_d = 0;
	            uint32_t min_s = 999999, max_s = 0;
	            uint8_t  frame_valid = 0;

	            for (int z = 0; z < NUM_ZONES; z++)
	            {
	                /* ZONE FILTER: Skip disabled zones */
	                if (!is_zone_enabled(z)) continue;
	                if (!g_zone_valid[z]) continue;

	                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
	                if (Results.target_status[idx] != 0 &&
	                    Results.target_status[idx] != 5 &&
	                    Results.target_status[idx] != 9) continue;

	                frame_valid++;
	                if (Results.distance_mm[idx] < min_d) min_d = Results.distance_mm[idx];
	                if (Results.distance_mm[idx] > max_d) max_d = Results.distance_mm[idx];
	                if (Results.signal_per_spad[idx] < min_s) min_s = Results.signal_per_spad[idx];
	                if (Results.signal_per_spad[idx] > max_s) max_s = Results.signal_per_spad[idx];
	            }

	            if (frame_valid > 0 && (capture_count == 0 || (g_baseline_distance[0] > 0 && min_d < g_baseline_distance[0])))
	            {
	                printf(". zones=%2d  dist=%4d-%4dmm  signal=%5d-%5d  (captures: %lu)\r\n",
	                       frame_valid, min_d, max_d, min_s, max_s,
	                       (unsigned long)capture_count);
	            }

#if DEBUG_FRAME_INTERVAL > 0
	            /* Per-zone debug frame for Python visualization
	               Format: ZFRAME,sig1,base1,dist1,bdist1,...,sig16,base16,dist16,bdist16
	               - sigN  = current signal_per_spad for zone N
	               - baseN = baseline signal for zone N
	               - distN = current distance_mm for zone N
	               - bdistN= baseline distance_mm for zone N
	               Use 0 for invalid/unavailable zones. */
	            static uint32_t debug_frame_counter = 0;
	            debug_frame_counter++;
	            if (debug_frame_counter >= DEBUG_FRAME_INTERVAL) {
	                debug_frame_counter = 0;
	                printf("ZFRAME,");
	                for (int z = 0; z < NUM_ZONES; z++) {
	                    uint32_t cur_sig = 0, cur_dist = 0;
	                    uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
	                    if (g_zone_valid[z] && is_zone_enabled(z) &&
	                        (Results.target_status[idx] == 0 ||
	                         Results.target_status[idx] == 5 ||
	                         Results.target_status[idx] == 9)) {
	                        cur_sig  = Results.signal_per_spad[idx];
	                        cur_dist = Results.distance_mm[idx];
	                    }
	                    if (z > 0) printf(",");
	                    printf("%lu,%lu,%lu,%lu",
	                           (unsigned long)cur_sig,
	                           (unsigned long)g_baseline_signal[z],
	                           (unsigned long)cur_dist,
	                           (unsigned long)g_baseline_distance[z]);
	                }
	                printf("\r\n");
	            }
#endif
	        }
	    }
}

/* ================================================================
   SECTION 15: FREERTOS INITIALIZATION
   ================================================================ */

/**
 * @brief  Create and start FreeRTOS tasks
 *
 *         Creates two static tasks:
 *         - main_thread (priority 2): Board initialization, then deletes itself
 *         - btn_thread  (priority 3): Button polling and capture loop
 */
static int main_freertos(void)
{
    TaskHandle_t hdl;

    hdl = xTaskCreateStatic(main_thread_fct, "main",
                            configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 1,
                            main_thread_stack, &main_thread_cb);
    assert(hdl != NULL);

    /* Create insect detection task (priority: IDLE+2 - higher than button) */
    hdl = xTaskCreateStatic(insect_detection_task, "insect",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            insect_thread_stack, &insect_thread_cb);
    assert(hdl != NULL);

    /* Button task at HIGHER priority for immediate response */
    hdl = xTaskCreateStatic(btn_thread_fct, "btn",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            btn_thread_stack, &btn_thread_cb);
    assert(hdl != NULL);

    vTaskStartScheduler();
    assert(0);
    return -1;
}


/* ================================================================
   SECTION 16: MAIN THREAD (runs once: board init, then deletes)
   ================================================================ */

/**
 * @brief  Main initialization task
 *
 *         Performs all hardware initialization in sequence:
 *         1. NVIC priorities
 *         2. System clock
 *         3. Debug console
 *         4. Fuse programming
 *         5. WS2812 illumination (DMA + TIM)
 *         6. VL53L5CX ToF sensor (I2C + GPIO)
 *         7. PSRAM (XSPI RAM + NOR)
 *         8. LEDs + User button
 *         9. Security + IAC config
 *         10. Low-power clock gates
 *         11. SD card init + benchmark
 *         12. Set system_ready flag, delete task
 */
static void main_thread_fct(void *arg)
{
    (void)arg;
    uint32_t preemptPriority, subPriority;
    IRQn_Type i;
    int ret;

    /* ---- NVIC Priority Configuration ---- */
    HAL_NVIC_GetPriority(SysTick_IRQn, HAL_NVIC_GetPriorityGrouping(),
                         &preemptPriority, &subPriority);
    for (i = PVD_PVM_IRQn; i <= LTDC_UP_ERR_IRQn; i++)
        HAL_NVIC_SetPriority(i, preemptPriority, subPriority);

    /* ---- Clocks + Console + Fuses ---- */
    SystemClock_Config();
    vPortSetupTimerInterrupt();
    CONSOLE_Config();
    Fuse_Programming();

    /* ---- Illumination System (WS2812) ---- */
    printf("[INIT] Light system\n");
    MX_GPDMA1_Init();
    MX_TIM1_Init();
    WS2812_Init();

    /* ---- VL53L5CX ToF Sensor (I2C1 + GPIO) ---- */
    VL53L5CX_I2C_Init();
    VL53L5CX_GPIO_Init();
    VL53L5CX_StartSequence();

    /* ---- PSRAM Initialization ---- */
#ifdef STM32N6570_DK_REV
    BSP_XSPI_RAM_Init(0);
    BSP_XSPI_RAM_EnableMemoryMappedMode(0);
#endif

    BSP_XSPI_NOR_Init_t NOR_Init;
    NOR_Init.InterfaceMode  = BSP_XSPI_NOR_OPI_MODE;
    NOR_Init.TransferRate   = BSP_XSPI_NOR_DTR_TRANSFER;
    BSP_XSPI_NOR_Init(0, &NOR_Init);
    BSP_XSPI_NOR_EnableMemoryMappedMode(0);

    /* ---- LEDs + User Button ---- */
    ret = BSP_LED_Init(LED_GREEN); assert(ret == BSP_ERROR_NONE);
    ret = BSP_LED_Init(LED_RED);   assert(ret == BSP_ERROR_NONE);

    BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
    printf("[BTN] PC13 initialized via BSP (active HIGH). State=%s\n",
           BSP_PB_GetState(BUTTON_USER1) == GPIO_PIN_SET ? "PRESSED" : "RELEASED");

    /* ---- Security + IAC ---- */
    Security_Config();
    IAC_Config();

    /* ---- Low-Power Clock Gates ---- */
    LL_BUS_EnableClockLowPower(~0);
    LL_MEM_EnableClockLowPower(~0);
    LL_AHB1_GRP1_EnableClockLowPower(~0);
    LL_AHB2_GRP1_EnableClockLowPower(~0);
    LL_AHB3_GRP1_EnableClockLowPower(~0);
    LL_AHB4_GRP1_EnableClockLowPower(~0);
    LL_AHB5_GRP1_EnableClockLowPower(~0);
    LL_APB1_GRP1_EnableClockLowPower(~0);
    LL_APB1_GRP2_EnableClockLowPower(~0);
    LL_APB2_GRP1_EnableClockLowPower(~0);
    LL_APB4_GRP1_EnableClockLowPower(~0);
    LL_APB4_GRP2_EnableClockLowPower(~0);
    LL_APB5_GRP1_EnableClockLowPower(~0);
    LL_MISC_EnableClockLowPower(~0);

    /* ---- SD Card Initialization ---- */
    printf("\n=== SD Card Detection Test ===\n");

    HAL_PWREx_EnableVddIO5();
    for (volatile uint32_t d = 0; d < 500000; d++);

    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_SDMMC2;
    PeriphClkInit.Sdmmc2ClockSelection  = RCC_SDMMC2CLKSOURCE_HCLK;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

    __HAL_RCC_SDMMC2_FORCE_RESET();
    for (volatile uint32_t d = 0; d < 1000; d++);
    __HAL_RCC_SDMMC2_RELEASE_RESET();
    for (volatile uint32_t d = 0; d < 1000; d++);

    hsd1.Instance             = SDMMC2;
    hsd1.Init.ClockEdge       = SDMMC_CLOCK_EDGE_RISING;
    hsd1.Init.ClockPowerSave  = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    hsd1.Init.BusWide         = SDMMC_BUS_WIDE_4B;
    hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd1.Init.ClockDiv        = 2;
    hsd1.State                = HAL_SD_STATE_RESET;

