SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    HAL_SD_MspInit(&hsd1);
    HAL_StatusTypeDef status = HAL_SD_Init(&hsd1);

    if (status == HAL_OK) {
        printf("[SD] Switching to 4-bit bus width...\n");
        status = HAL_SD_ConfigWideBusOperation(&hsd1, SDMMC_BUS_WIDE_4B);
        if (status == HAL_OK) {
            hsd1.Init.BusWide = SDMMC_BUS_WIDE_4B;
            printf("[SD] 4-bit bus width configured successfully\n");
        } else {
            printf("[SD] Wide bus config failed (%lu), staying in 1-bit\n", (unsigned long)status);
            status = HAL_OK;
        }
    }

    if (status == HAL_OK) {
        uint64_t     total_bytes = (uint64_t)hsd1.SdCard.BlockNbr * (uint64_t)hsd1.SdCard.BlockSize;
        unsigned long size_mb    = (unsigned long)(total_bytes / 1048576UL);
        unsigned long size_gb    = (unsigned long)(total_bytes / 1073741824UL);

        printf("\n*** SD CARD DETECTED SUCCESSFULLY! ***\n\n");
        printf("  Card Size: %lu GB (%lu MB)\n", size_gb, size_mb);
        printf("  Blocks:    %lu x %lu bytes\n",
               (unsigned long)hsd1.SdCard.BlockNbr, (unsigned long)hsd1.SdCard.BlockSize);
        printf("  Card Type: %s\n",
               (hsd1.SdCard.CardType == CARD_SDHC_SDXC) ? "SDHC/SDXC" : "SDSC");
        printf("  Bus Width: %s\n",
               (hsd1.Init.BusWide == SDMMC_BUS_WIDE_4B) ? "4-bit" : "1-bit");

        /* Storage capacity info */
        uint32_t blocks_per_snap = (SD_IMG_HEADER_SIZE + SNAP_FRAME_SIZE + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
        uint32_t available_blocks = hsd1.SdCard.BlockNbr - SD_SNAP_BASE_BLOCK;
        uint32_t max_snaps = available_blocks / blocks_per_snap;
        printf("  Blocks/snapshot: %lu\n", (unsigned long)blocks_per_snap);
        printf("  Max snapshots: ~%lu (from block %lu onward)\n",
               (unsigned long)max_snaps, (unsigned long)SD_SNAP_BASE_BLOCK);
        printf("\n");

        SD_Benchmarks();
    } else {
        printf("[ERROR] SD card init failed: %lu\n", (unsigned long)status);
    }

    /* ---- System Ready ---- */
    printf("\n===========================================\n");
    printf("[INFO] System READY!\n");
    printf("[INFO] Camera: ON-DEMAND (init per capture)\n");
    printf("[INFO] Press USER button (PC13) to capture + save.\n");
    printf("===========================================\n\n");

    system_ready = 1;
    vTaskDelete(NULL);
}


/* ================================================================
   SECTION 17: DCMIPP CLOCK CONFIGURATION
   ================================================================ */

/**
 * @brief  Configure DCMIPP and CSI clock sources
 *
 *         DCMIPP → IC17 from PLL2/3
 *         CSI    → IC18 from PLL1/40
 */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
    (void)hdcmipp;
    RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
    HAL_StatusTypeDef        ret;

    RCC_PeriphCLKInitStruct.PeriphClockSelection   = RCC_PERIPHCLK_DCMIPP;
    RCC_PeriphCLKInitStruct.DcmippClockSelection   = RCC_DCMIPPCLKSOURCE_IC17;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL2;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockDivider   = 3;
    ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
    if (ret) return ret;

    RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CSI;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockDivider   = 40;
    ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
    if (ret) return ret;

    return HAL_OK;
}


/* ================================================================
   SECTION 18: USB MSP INIT
   ================================================================ */

/**
 * @brief  USB OTG HS MSP initialization (called by HAL when USB is used)
 */
void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
    assert(hpcd->Instance == USB1_OTG_HS);
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWREx_EnableVddUSBVMEN();
    while (__HAL_PWR_GET_FLAG(PWR_FLAG_USB33RDY) == 0U);
    HAL_PWREx_EnableVddUSB();
    __HAL_RCC_USB1_OTG_HS_CLK_ENABLE();
    USB1_HS_PHYC->USBPHYC_CR &= ~(0x7U << 0x4U);
    USB1_HS_PHYC->USBPHYC_CR |= (0x2U << 0x4U);
    __HAL_RCC_USB1_OTG_HS_PHY_CLK_ENABLE();
    HAL_NVIC_SetPriority(USB1_OTG_HS_IRQn, 6U, 0U);
    HAL_NVIC_EnableIRQ(USB1_OTG_HS_IRQn);
}


/* ================================================================
   SECTION 19: PERIPHERAL INITIALIZATION (TIM1, GPDMA1, CLOCK)
   ================================================================ */

/**
 * @brief  TIM1 initialization for WS2812 PWM signal generation
 *
 *         Prescaler = 5 → 200 MHz / 6 = 33.33 MHz timer clock
 *         Period    = 500 → PWM frequency ≈ 66.67 kHz
 *         Channel 1, PWM1 mode
 */
static void MX_TIM1_Init(void)
{
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};
    TIM_OC_InitTypeDef sConfigOC = {0};
    TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};

    htim1.Instance = TIM1;
    htim1.Init.Prescaler = 5;      /* 200 MHz / 6 = 33.33 MHz */
    htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim1.Init.Period = 500;
    htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.RepetitionCounter = 0;
    htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim1);

    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig);
    HAL_TIM_PWM_Init(&htim1);

    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1);

    sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
    sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime = 0;
    sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
    HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig);

    HAL_TIM_MspPostInit(&htim1);
}

/**
 * @brief  Configure peripheral common clock (TIM prescaler)
 */
void PeriphCommonClock_Config(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_TIM;
    PeriphClkInitStruct.TIMPresSelection = RCC_TIMPRES_DIV1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
        //Error_Handler();
    }
}

/**
 * @brief  GPDMA1 initialization for WS2812 data transmission
 *
 *         Enables GPDMA1 clock and configures Channel1 IRQ.
 */
static void MX_GPDMA1_Init(void)
{
    __HAL_RCC_GPDMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
}


/* ================================================================
   SECTION 20: I2C1 INITIALIZATION (VL53L5CX ToF Sensor)
   ================================================================ */

/**
 * @brief  I2C1 initialization for VL53L5CX Time-of-Flight sensor
 *
 *         Timing: 0x00401242 (100 kHz standard mode)
 *         Addressing: 7-bit
 *         Analog filter: enabled
 *         Fast mode plus: enabled
 */
static void VL53L5CX_I2C_Init(void)
{
    hi2c1.Instance = I2C1;
    hi2c1.Init.Timing = 0x00401242;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

