SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        //Error_Handler();
    }

    /* Configure Analog filter */
    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK) {
        //Error_Handler();
    }

    /* Configure Digital filter */
    if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
        //Error_Handler();
    }

    /* I2C Fast mode Plus enable */
    if (HAL_I2CEx_ConfigFastModePlus(&hi2c1, I2C_FASTMODEPLUS_ENABLE) != HAL_OK) {
        //Error_Handler();
    }
}


/* ================================================================
   SECTION 21: VL53L5CX TIME-OF-FLIGHT SENSOR FUNCTIONS
   ================================================================ */

/**
 * @brief  Initialize GPIO pins for VL53L5CX control signals
 *
 *         Pin Mapping:
 *           - PD0  → PWR_EN  (Power Enable, active HIGH)
 *           - PE7  → I2C_RST (Reset, active LOW pulse)
 *           - PD6  → LPn     (Low Power disable, active HIGH)
 */
static void VL53L5CX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* PWR_EN (PD0) - Power Enable output */
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    /* I2C_RST (PE7) - Reset output */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    /* LPn (PD6) - Low Power mode disable output */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
}

/**
 * @brief  Execute VL53L5CX power-up sequence
 *
 *         Sequence:
 *           1. Assert PWR_EN (PD0 HIGH)
 *           2. Pulse reset (PE7 LOW → HIGH)
 *           3. Disable low-power mode (PD6 HIGH)
 *           4. Wait for sensor stabilization
 */
static void VL53L5CX_StartSequence(void)
{
    printf("\n=== ToF Sensor Power Up ===\n");

    /* Step 1: Enable power (PWR_EN = HIGH) */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
    HAL_Delay(10);  /* Power stabilization delay */

    /* Step 2: Reset pulse (active LOW) */
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7, GPIO_PIN_RESET);
    HAL_Delay(10);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7, GPIO_PIN_SET);
    HAL_Delay(10);

    /* Step 3: Disable Low Power mode (LPn = HIGH) */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_SET);
    HAL_Delay(100);

    printf("[OK] Sensor power-up complete\n\n");
}

/**
 * @brief  Validate VL53L5CX sensor presence and initialize
 *
 *         Checks if the sensor is alive at I2C address 0x29,
 *         initializes the device, and scans the I2C bus for
 *         all connected devices.
 */
static void VL53L5CX_Validate(void)
{
    Dev.platform.address = 0x29;

    /* Check if sensor is alive */
    status = vl53l5cx_is_alive(&Dev, &isAlive);
    printf("ALIVE %i and status %i\r\n", isAlive, status);

    if (!isAlive || status) {
        printf("Sensor NOT detected\r\n");
    } else {
        printf("Sensor detected\r\n");

        status = vl53l5cx_init(&Dev);
        if (status) {
            printf("Init FAIL\r\n");
        } else {
            printf("Init OK\r\n");
            vl53l5cx_start_ranging(&Dev);
        }
    }
    HAL_Delay(1000);

    /* Scan I2C bus for all connected devices */
    for (uint8_t addr = 0; addr < 128; addr++) {
        if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 1, 10) == HAL_OK) {
            printf("I2C device found at 0x%02X\r\n", addr);
        }
    }
}

/**
 * @brief  Configure VL53L5CX for high-performance continuous ranging
 *
 *         Settings:
 *           - Resolution:    8x8 (64 zones)
 *           - Integration:   800 ms
 *           - Frequency:     15 Hz
 *           - Target order:  Closest object
 *           - Sharpener:     10%
 *           - Mode:          Continuous
 *
 *         After configuration, reads 6 sample frames and prints
 *         distance + target status for all 64 zones.
 */
static void VL53L5CX_ReadingTest(void)
{

    /* ---- High-Performance Configuration ---- */
    status = vl53l5cx_set_resolution(&Dev, VL53L5CX_RESOLUTION_4X4);

    uint8_t  is_ready;
	    uint8_t  i;

	    /* Reset baseline state */
	    memset(g_baseline_signal, 0, sizeof(g_baseline_signal));
	    memset(g_baseline_distance, 0, sizeof(g_baseline_distance));
	    memset(g_zone_valid, 0, sizeof(g_zone_valid));
	    g_baseline_ready = 0;

	    /* Integration time: 800 ms */
	    status = vl53l5cx_set_integration_time_ms(&Dev, 800);

	    /* Ranging frequency: 15 Hz (maximum for 8x8 resolution) */
	    status = vl53l5cx_set_ranging_frequency_hz(&Dev, 15);

	    /* Always report the closest object */
	    status = vl53l5cx_set_target_order(&Dev, VL53L5CX_TARGET_ORDER_CLOSEST);

	    /* Sharpener at 10% to reduce pixel blurring */
	    status = vl53l5cx_set_sharpener_percent(&Dev, 10);

	    /* Continuous ranging mode */
	    status = vl53l5cx_set_ranging_mode(&Dev, VL53L5CX_RANGING_MODE_CONTINUOUS);

	    /* ---- Start Ranging ---- */
	    vl53l5cx_start_ranging(&Dev);
	    VL53L5CX_WaitMs(&(Dev.platform), 200);
	    printf("Ranging started...\r\n");

	    /* ================================================================ */
	    /*  Phase 1: Learn per-zone baseline signal                         */
	    /* ================================================================ */
	    printf("\r\n[BASELINE] Taking %d samples per zone...\r\n", BASELINE5CX_SAMPLES);

	    for (i = 0; i < BASELINE5CX_SAMPLES; i++)
	    {
	        /* Wait for data ready */
	        do {
	            vl53l5cx_check_data_ready(&Dev, &is_ready);
	            if (!is_ready) HAL_Delay(10);
	        } while (!is_ready);

	        /* Get results (includes implicit interrupt clear) */
	        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
	            continue;

	        /* Accumulate per-zone signal and distance */
	        for (int z = 0; z < NUM_ZONES; z++)
	        {
	            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

