SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
	            if (Results.target_status[idx] == 0 || Results.target_status[idx] == 5 ||Results.target_status[idx] == 9)  /* Valid measurement */
	            {
	                g_baseline_signal[z] += Results.signal_per_spad[idx];
	                g_baseline_distance[z] += Results.distance_mm[idx];
	                g_zone_valid[z] = 1;
	            }
	        }

	        /* Progress indicator */
	        printf("  [%d/ %d]\r", i + 1, BASELINE5CX_SAMPLES);
	    }

	    /* Compute per-zone averages */
	    printf("\r\n[BASELINE] Zone | Distance(mm) | Signal(kcps/spad)\r\n");
	    printf("----------|----------------|----------------------\r\n");

	    uint8_t valid_zone_count = 0;

	    for (int z = 0; z < NUM_ZONES; z++)
	    {
	        if (g_zone_valid[z])
	        {
	            g_baseline_signal[z] /= BASELINE5CX_SAMPLES;
	            g_baseline_distance[z] /= BASELINE5CX_SAMPLES;
	            valid_zone_count++;

	            printf("  Z%2d    |    %8d     |    %10d\r\n",
	                   z, g_baseline_distance[z], g_baseline_signal[z]);
	        }
	    }

	    printf("\r\n[BASELINE] Valid zones: %d/%d\r\n", valid_zone_count, NUM_ZONES);
	    printf("[BASELINE] Insect threshold: >%d%% drop in any zone\r\n",
	           INSECT5CX_THRESHOLD_PCT);
	    g_baseline_ready = 1;

	    /* ================================================================ */
	    /*  Phase 2: Monitor per-zone for insect detection                  */
	    /* ================================================================ */
	    printf("\r\n[MONITORING] Watching %d zones for insect passage...\r\n",
	           valid_zone_count);
	    printf("  (Wave your hand or blow air in front of the sensor to simulate)\r\n\n");

	    while (1)
	    {
	        /* Wait for data ready */
	        do {
	            vl53l5cx_check_data_ready(&Dev, &is_ready);
	            if (!is_ready) HAL_Delay(10);
	        } while (!is_ready);

	        /* Get results */
	        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
	            continue;

	        /* ---- Check each zone independently against its own baseline ---- */
	        uint8_t  insect_found = 0;
	        uint8_t  affected_zones[NUM_ZONES] = {0};
	        uint32_t affected_drop[NUM_ZONES] = {0};
	        uint8_t  affected_count = 0;

	        for (int z = 0; z < NUM_ZONES; z++)
	        {
	            if (!g_zone_valid[z])
	                continue;  /* Skip zones with no baseline */

	            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

	            if (Results.target_status[idx] != 0 && Results.target_status[idx] != 5 && Results.target_status[idx] != 9)
	                continue;  /* Skip invalid measurements this frame */

	            /* Compute signal drop for this zone vs its own baseline */
	            uint32_t signal_drop = 0;
	            if (g_baseline_signal[z] > 0)
	            {
	                int32_t diff = (int32_t)g_baseline_signal[z] -
	                               (int32_t)Results.signal_per_spad[idx];
	                if (diff < 0) diff = -diff;
	                signal_drop = (uint32_t)diff * 100 / g_baseline_signal[z];
	            }

	            if (signal_drop > INSECT5CX_THRESHOLD_PCT)
	            {
	                affected_zones[affected_count] = z;
	                affected_drop[affected_count] = signal_drop;
	                affected_count++;
	                insect_found = 1;
	            }
	        }

	        /* ---- Report results ---- */
	        if (insect_found)
	        {
	            /* Build zone list string */
	            char zone_list[64] = {0};
	            for (uint8_t k = 0; k < affected_count; k++)
	            {
	                char tmp[16];
	                sprintf(tmp, "Z%u", affected_zones[k]);
	                if (k == 0)
	                    strcpy(zone_list, tmp);
	                else
	                    strcat(zone_list, ",");
	                    strcat(zone_list, tmp);
	            }

	            printf(">>> INSECT DETECTED! Zones: [%s] (%u zone(s))\r\n",
	                   zone_list, affected_count);

	            /* Print details for each affected zone */
	            for (uint8_t k = 0; k < affected_count; k++)
	            {
	                uint8_t z = affected_zones[k];
	                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
	                printf("    Z%2d: dist=%4dmm  signal=%6d  baseline=%6d  (drop=%u%%)\r\n",
	                       z,
	                       Results.distance_mm[idx],
	                       Results.signal_per_spad[idx],
	                       g_baseline_signal[z],
	                       affected_drop[k]);
	            }
	            printf("\r\n");
	        }
	        else
	        {
	            /* Compact status: show min/max distance and signal across valid zones */
	            uint16_t min_d = 9999, max_d = 0;
	            uint32_t min_s = 999999, max_s = 0;
	            uint8_t  frame_valid = 0;

	            for (int z = 0; z < NUM_ZONES; z++)
	            {
	                if (!g_zone_valid[z]) continue;
	                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
	                if (Results.target_status[idx] != 0 && Results.target_status[idx] != 5 && Results.target_status[idx] != 9) continue;

	                frame_valid++;
	                if (Results.distance_mm[idx] < min_d) min_d = Results.distance_mm[idx];
	                if (Results.distance_mm[idx] > max_d) max_d = Results.distance_mm[idx];
	                if (Results.signal_per_spad[idx] < min_s) min_s = Results.signal_per_spad[idx];
	                if (Results.signal_per_spad[idx] > max_s) max_s = Results.signal_per_spad[idx];
	            }

	            if (frame_valid > 0)
	            {
	                printf(". zones=%2d  dist=%4d-%4dmm  signal=%5d-%5d\r\n",
	                       frame_valid, min_d, max_d, min_s, max_s);
	            }
	        }
	    }
}


/**
 * @brief  VL53L5CX Motion + Insect Detection with Hardware Motion Indicator
 *
 *         Uses both software signal-drop detection AND hardware-accelerated
 *         motion indicator for robust insect detection.
 *
 *         Zone mask (g_zone_mask) can be configured at runtime to narrow
 *         the effective FOV. Call VL53L5CX_SetZoneMask() before this function.
 */
static void VL53L5CX_MotionTest(void)
{
    VL53L5CX_Motion_Configuration motion_config;
    uint8_t  ready;

    printf("\r\n=== VL53L5CX Insect + Motion Detection (4x4 zones) ===\r\n");

    /* ---- Configuration ---- */
    status = vl53l5cx_set_resolution(&Dev, VL53L5CX_RESOLUTION_4X4);
    status = vl53l5cx_set_integration_time_ms(&Dev, 800);
    status = vl53l5cx_set_ranging_frequency_hz(&Dev, 15);
    status = vl53l5cx_set_target_order(&Dev, VL53L5CX_TARGET_ORDER_CLOSEST);
    status = vl53l5cx_set_sharpener_percent(&Dev, 10);
    status = vl53l5cx_set_ranging_mode(&Dev, VL53L5CX_RANGING_MODE_CONTINUOUS);

