SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    /* ---- Init hardware motion indicator ---- */
    status = vl53l5cx_motion_indicator_init(&Dev, &motion_config, VL53L5CX_RESOLUTION_4X4);
    if (status)
        printf("[WARN] Motion indicator init failed: %d\r\n", status);

    status = vl53l5cx_motion_indicator_set_distance_motion(&Dev, &motion_config, 1000, 2000);

    /* ---- Start ranging ---- */
    status = vl53l5cx_start_ranging(&Dev);
    VL53L5CX_WaitMs(&(Dev.platform), 200);

    /* ---- BASELINE ---- */
    printf("\r\n[BASELINE] Learning %d frames...\r\n", BASELINE5CX_SAMPLES);

    uint32_t baseline_signal_zone[16]  = {0};
    uint16_t baseline_distance_zone[16] = {0};
    uint8_t  valid_baseline_zones[16] = {0};
    uint8_t  baseline_samples_zone[16] = {0};

    for (uint8_t sample = 0; sample < BASELINE5CX_SAMPLES; sample++)
    {
        uint32_t timeout = 0;
        while (!ready && timeout < 100) {
            vl53l5cx_check_data_ready(&Dev, &ready);
            if (!ready) { VL53L5CX_WaitMs(&(Dev.platform), 10); timeout++; }
        }
        if (ready) {
            vl53l5cx_get_ranging_data(&Dev, &Results);
            for (int z = 0; z < 16; z++)
            {
                if (!is_zone_enabled(z)) continue;  /* Zone mask filter */
                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
                uint8_t s = Results.target_status[idx];
                if (s == 0 || s == 5 || s == 9) {
                    uint16_t dist = Results.distance_mm[idx];
                    if (dist > 20 && dist < 4000) {
                        valid_baseline_zones[z] = 1;
                        baseline_signal_zone[z] += Results.signal_per_spad[idx];
                        baseline_distance_zone[z] = dist;
                        baseline_samples_zone[z]++;
                    }
                }
            }
        }
        ready = 0;
        VL53L5CX_WaitMs(&(Dev.platform), 70);
    }

    /* Compute averages */
    uint8_t valid_zone_count = 0;
    for (int z = 0; z < 16; z++)
    {
        if (baseline_samples_zone[z] > 0) {
            baseline_signal_zone[z] /= baseline_samples_zone[z];
            valid_zone_count++;
        } else {
            valid_baseline_zones[z] = 0;
        }
    }

    printf("\r\n[BASELINE] Valid Zones: %d/16\r\n", valid_zone_count);
    printf("[BASELINE] Insect threshold: >%d%% signal drop\r\n", INSECT5CX_THRESHOLD_PCT);
    printf("[BASELINE] Motion threshold: >%d motion power\r\n", MOTION_INDICATOR_THRESH);

    /* ---- MONITORING ---- */
    printf("\r\n[MONITORING] Watching %d zones...\r\n\r\n", valid_zone_count);

    uint32_t frame_count = 0, insect_count = 0, motion_count = 0;

    for (;;)
    {
        uint32_t timeout = 0;
        while (!ready && timeout < 100) {
            vl53l5cx_check_data_ready(&Dev, &ready);
            if (!ready) { VL53L5CX_WaitMs(&(Dev.platform), 10); timeout++; }
        }
        if (!ready) { VL53L5CX_WaitMs(&(Dev.platform), 20); continue; }

        vl53l5cx_get_ranging_data(&Dev, &Results);
        frame_count++;

        uint8_t insect_found = 0, motion_found = 0;
        uint8_t insect_zones[16] = {0}, motion_zones[16] = {0};
        uint8_t insect_zone_count = 0, motion_zone_count = 0;
        uint8_t valid_measurements = 0;

        for (int z = 0; z < 16; z++)
        {
            if (!is_zone_enabled(z)) continue;  /* Zone mask filter */
            if (!valid_baseline_zones[z]) continue;

            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
            if (Results.target_status[idx] != 0 &&
                Results.target_status[idx] != 5 &&
                Results.target_status[idx] != 9) continue;

            uint16_t dist = Results.distance_mm[idx];
            if (dist < 20 || dist > 4000) continue;

            valid_measurements++;

            /* Signal-drop insect detection */
            if (baseline_signal_zone[z] > 0) {
                int32_t diff = (int32_t)baseline_signal_zone[z] -
                               (int32_t)Results.signal_per_spad[idx];
                if (diff > 0) {
                    uint32_t drop = (uint32_t)diff * 100 / baseline_signal_zone[z];
                    if (drop > INSECT5CX_THRESHOLD_PCT) {
                        insect_zones[z] = 1;
                        insect_zone_count++;
                        insect_found = 1;
                    }
                }
            }

            /* Hardware motion indicator */
            if (Results.motion_indicator.motion[motion_config.map_id[z]] >= MOTION_INDICATOR_THRESH) {
                motion_zones[z] = 1;
                motion_zone_count++;
                motion_found = 1;
            }
        }

        /* Report insect */
        if (insect_found && valid_measurements > 5) {
            printf(">>> INSECT DETECTED! Frame %d (%d zones)\r\n",
                   frame_count, insect_zone_count);
            insect_count++;
        }

        /* Report motion */
        if (motion_found) {
            printf(">>> MOTION DETECTED! Frame %d (%d zones)\r\n",
                   frame_count, motion_zone_count);
            motion_count++;
        }

        /* Periodic status */
        if (!insect_found && !motion_found && valid_measurements > 0 && frame_count % 50 == 0) {
            printf(". frame=%d zones=%d (insect:%d motion:%d)\r\n",
                   frame_count, valid_measurements, insect_count, motion_count);
        }

        VL53L5CX_WaitMs(&(Dev.platform), 20);
    }
}

/* ================================================================
   SECTION 22: ASSERT CALLBACK
   ================================================================ */

#ifdef USE_FULL_ASSERT
/**
 * @brief  Report an assertion failure
 *
 *         Breaks into debugger (if attached) otherwise traps
 *         in an infinite loop.
 */
void assert_failed(uint8_t *file, uint32_t line)
{
    UNUSED(file);
    UNUSED(line);
    __BKPT(0);
    while (1) {}
}
#endif


/* ================================================================
   SECTION 23: DEBUG HELPER
   ================================================================ */

/**
 * @brief  Clean and invalidate the entire D-Cache
 *
 *         Placed in .keep_me section to prevent linker removal.
 *         Useful for debugging DMA/cache coherency issues.
 */
__attribute__((section(".keep_me")))
void app_clean_invalidate_dbg(void)
{
    SCB_CleanInvalidateDCache();
}
